<a href="https://colab.research.google.com/github/muhsintsn/python_Assignment_Project/blob/main/istatistik_%C3%B6dev_5.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
import scipy
print(scipy.__version__)

1.6.2

In [ ]:
import numpy as np
import scipy.stats as stats
import matplotlib.pyplot as plt
%matplotlib inline

ALIŞTIRMA 1.  Belirli bir sektördeki saatlik ücretler normal olarak ortalama  mu  = 13,20$ ve standart sapma s d= 2,50$ ile dağıtılır. 

Bu sektördeki bir şirket 40 işçi çalıştırıyor ve onlara saatte ortalama 12,20 dolar ödüyor. Bu şirket standartların altında ücret ödemekle suçlanabilir mi? Bir α = .01 seviye testi kullanın. (Wackerly, Ör.10.18)



KONTROL:
istatistik: -2.5298221281347035, 
pdeğeri= 0.005706018193000826

In [ ]:
mu = 13.20
sd = 2.50
n = 40
x = 12.20
alpha = 0.01

In [ ]:
# Ho : mu = 13.20
# Ha : mu != 13.20
z_stats = ((x - mu) / (sd/n**0.5))
z_stats

-2.5298221281347035

In [ ]:
p_value = stats.norm.cdf(z_stats)
p_value

0.005706018193000826

In [ ]:
 #Decision
alpha = 0.01

if p_value < alpha:
    print("Reject the null")
else:
    print("Fail to reject the null")

Reject the null

ALIŞTIRMA 2. İki tip zemin için serbest basınç testlerinden elde edilen kesme mukavemeti ölçümleri, aşağıdaki belgede gösterilen sonuçları verdi (ölçümler, fit kare başına ton olarak). Zeminler, %1 anlamlılık düzeyinde ortalama kesme dayanımına göre farklılık gösteriyor mu?


KONTROL: 

istatistik: 5.1681473319343345,

pvalue= 2.593228732352821e-06

In [ ]:
import pandas as pd

In [ ]:
soil = pd.read_excel("soil.xlsx")
soil.head()

   Soil1  Soil2
0  1.442  1.364
1  1.943  1.878
2  1.110  1.337
3  1.912  1.828
4  1.553  1.371

In [ ]:
soil.isnull().sum()

Soil1    5
Soil2    0
dtype: int64

In [ ]:
#s1=soil.Soil1[soil.Soil1.notnull()]
#s2=soil.Soil2

In [ ]:
s1=soil.Soil1.values[soil.Soil1.notnull()]
s1

array([1.442, 1.943, 1.11 , 1.912, 1.553, 1.641, 1.499, 1.347, 1.685,
       1.578, 1.866, 1.653, 1.665, 1.64 , 1.976, 1.754, 1.589, 1.976,
       1.863, 1.932, 1.57 , 1.613, 2.054, 1.55 , 1.714, 1.896, 1.737,
       1.74 , 1.708, 1.548])

In [ ]:
s2=soil.Soil2.values
s2

array([1.364, 1.878, 1.337, 1.828, 1.371, 1.428, 1.119, 1.373, 1.589,
       1.714, 1.26 , 1.492, 1.395, 1.778, 1.611, 1.202, 1.542, 1.094,
       1.557, 1.053, 1.183, 1.367, 1.144, 1.151, 1.561, 1.192, 1.489,
       1.379, 1.501, 1.277, 1.593, 1.172, 1.51 , 1.74 , 1.355])

In [ ]:
# Ho : mu1 = mu2
# Ha : mu1 != mu2
#alpha = 0.01

test = stats.ttest_ind(s1,s2)
test

Ttest_indResult(statistic=5.1681473319343345, pvalue=2.593228732352821e-06)

ALIŞTIRMA 4. Örnek veri seti, dört konu alanı için (100 puan üzerinden) yerleştirme testi puanlarına sahiptir: İngilizce, Okuma, Matematik ve Yazma. Örneklemdeki öğrenciler, üniversiteye kayıt olduklarında 4 yerleştirme sınavının hepsini tamamlamıştır. Özellikle İngilizce ve Matematik bölümleriyle ilgilendiğimizi ve öğrencilerin İngilizce veya Matematik sınavlarında ortalama olarak daha yüksek puan alıp almadıklarını belirlemek istediğimizi varsayalım. İki testin ortalamasında anlamlı bir fark olup olmadığını test etmek için eşleştirilmiş bir t testi kullanabiliriz.


KONTROL:

istatistik=36.312568981719856, 

pvalue=3.0710987192210606e-128

In [ ]:
student = pd.read_excel("students_2014.xlsx")

In [ ]:
student.head()

,ids,bday,enrolldate,expgradate,Rank,Major,Gender,Athlete,Height,Weight,...,English,Reading,Math,Writing,State,LiveOnCampus,HowCommute,CommuteTime,SleepTime,StudyTime
0,43783,1995-03-22,NaT,NaT,NaN,NaN,0.0,0,72.35,NaN,...,88.24,81.50,60.02,81.44,In state,1.0,NaN,NaN,7.0,1.0
1,20278,1995-01-01,NaT,NaT,NaN,Philosophy,0.0,0,70.66,179.20,...,89.45,85.25,70.19,73.27,NaN,1.0,NaN,NaN,5.0,2.0
2,20389,1994-12-31,NaT,NaT,NaN,NaN,0.0,0,70.68,198.52,...,96.73,86.88,71.20,84.24,In state,NaN,NaN,NaN,8.0,7.0
3,22820,1994-12-01,NaT,NaT,NaN,business administration,1.0,0,NaN,198.34,...,74.06,88.68,55.89,73.16,In state,1.0,NaN,NaN,2.0,6.0
4,24559,1994-11-10,NaT,NaT,NaN,NaN,1.0,1,67.43,128.17,...,82.61,77.30,65.52,80.45,Out of state,1.0,NaN,NaN,7.0,3.0

In [ ]:
student.isnull().sum()

ids               0
bday              8
enrolldate       29
expgradate       29
Rank             29
Major           159
Gender            9
Athlete           0
Height           27
Weight           59
Smoking          24
Sprint           61
MileMinDur       43
English          26
Reading          10
Math             13
Writing          31
State            27
LiveOnCampus     21
HowCommute      188
CommuteTime     188
SleepTime        32
StudyTime        42
dtype: int64

In [ ]:
less = student[['English', 'Math']]
less.head()

   English   Math
0    88.24  60.02
1    89.45  70.19
2    96.73  71.20
3    74.06  55.89
4    82.61  65.52

In [ ]:
less.isnull().sum()

English    26
Math       13
dtype: int64

In [ ]:
less.dropna(inplace=True)

<ipython-input-20-7a19e86bd3f3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  less.dropna(inplace=True)

In [ ]:
less

     English   Math
0      88.24  60.02
1      89.45  70.19
2      96.73  71.20
3      74.06  55.89
4      82.61  65.52
..       ...    ...
430    87.72  65.31
431    91.01  70.25
432    81.05  58.16
433    75.59  66.84
434    75.65  60.24

[398 rows x 2 columns]

In [ ]:
# Ho : mu1 = mu2
# Ha : mu != mu2

In [ ]:
mu1 = less.English
mu2 = less.Math

In [ ]:
# Ho : mu1 = mu2
# Ha : mu1 != mu2


stats.ttest_rel(mu1,mu2)

Ttest_relResult(statistic=36.312568981719856, pvalue=3.0710987192210606e-128)